# Occupation

### Introduction:

Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [77]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

In [5]:
users= pd.read_csv('/Users/aishwaryachinnari/Desktop/DSI-SF-3/datasets/affairs/occupation.csv',sep= '|')

### Step 3. Assign it to a variable called users.

In [7]:
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

### Step 4. Discover what is the mean age per occupation

In [52]:
users.groupby(['occupation'])['age'].mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least

In [99]:
users.head(4).T

                     0      1       2           3
user_id              1      2       3           4
age                 24     53      23          24
gender               M      F       M           M
occupation  technician  other  writer  technician
zip_code         85711  94043   32067       43537

In [141]:
occp_count = users.groupby(['occupation']).size().reset_index()
print occp_count.shape
occp_count.head(3)

(21, 2)

      occupation   0
0  administrator  79
1         artist  28
2         doctor   7

In [121]:
new_df  = users.groupby(['occupation', 'gender']).size().reset_index()
## create a column that has the total number of people per occupation

      occupation gender   0
0  administrator      F  36
1  administrator      M  43
2         artist      F  13

In [134]:
new_df_long = new_df.pivot(index="occupation", columns='gender', values=0).reset_index()

In [139]:
print new_df_long.shape
new_df_long.head(3)

(21, 3)

gender     occupation     F     M
0       administrator  36.0  43.0
1              artist  13.0  15.0
2              doctor   NaN   7.0

In [142]:
result = pd.merge(occp_count, new_df_long, on='occupation')

In [144]:
result['ratio'] = (result['M']/result[0])

In [146]:
result.sort?

In [148]:
result.sort("ratio", ascending=False)

/Users/aishwaryachinnari/anaconda/lib/python2.7/site-packages/ipykernel/__main__.py:1: FutureWarning: sort(columns=....) is deprecated, use sort_values(by=.....)
  if __name__ == '__main__':

       occupation    0     F      M     ratio
2          doctor    7   NaN    7.0  1.000000
4        engineer   67   2.0   65.0  0.970149
19     technician   27   1.0   26.0  0.962963
15        retired   14   1.0   13.0  0.928571
14     programmer   66   6.0   60.0  0.909091
6       executive   32   3.0   29.0  0.906250
17      scientist   31   3.0   28.0  0.903226
5   entertainment   18   2.0   16.0  0.888889
9          lawyer   12   2.0   10.0  0.833333
16       salesman   12   3.0    9.0  0.750000
3        educator   95  26.0   69.0  0.726316
18        student  196  60.0  136.0  0.693878
13          other  105  36.0   69.0  0.657143
11      marketing   26  10.0   16.0  0.615385
20         writer   45  19.0   26.0  0.577778
12           none    9   4.0    5.0  0.555556
0   administrator   79  36.0   43.0  0.544304
1          artist   28  13.0   15.0  0.535714
10      librarian   51  29.0   22.0  0.431373
7      healthcare   16  11.0    5.0  0.312500
8       homemaker    7   6.0    1.0  0.142857

### Step 6. For each occupation, calculate the minimum and maximum ages

In [93]:
users.groupby(['occupation'])['age'].min()

occupation
administrator    21
artist           19
doctor           28
educator         23
engineer         22
entertainment    15
executive        22
healthcare       22
homemaker        20
lawyer           21
librarian        23
marketing        24
none             11
other            13
programmer       20
retired          51
salesman         18
scientist        23
student           7
technician       21
writer           18
Name: age, dtype: int64

In [94]:
users.groupby(['occupation'])['age'].max()

occupation
administrator    70
artist           48
doctor           64
educator         63
engineer         70
entertainment    50
executive        69
healthcare       62
homemaker        50
lawyer           53
librarian        69
marketing        55
none             55
other            64
programmer       63
retired          73
salesman         66
scientist        55
student          42
technician       55
writer           60
Name: age, dtype: int64

### Step 7. For each combination of occupation and gender, calculate the mean age

In [50]:
users.groupby(['occupation','gender']).mean()

                         user_id        age
occupation    gender
administrator F       443.944444  40.638889
              M       420.069767  37.162791
artist        F       432.153846  30.307692
              M       469.000000  32.333333
doctor        M       533.714286  43.571429
educator      F       454.730769  39.115385
              M       471.492754  43.101449
engineer      F       806.500000  29.500000
              M       445.553846  36.600000
entertainment F       780.000000  31.000000
              M       350.250000  29.000000
executive     F       373.000000  44.000000
              M       427.413793  38.172414
healthcare    F       568.454545  39.818182
              M       354.000000  45.400000
homemaker     F       367.166667  34.166667
              M       898.000000  23.000000
lawyer        F       285.000000  39.500000
              M       373.900000  36.200000
librarian     F       449.137931  40.000000
              M       535.954545  40.000000
marketing     F       443.300000  37.200000
              M       434.375000  37.875000
none          F       521.750000  36.500000
              M       246.200000  18.600000
other         F       474.666667  35.472222
              M       578.246377  34.028986
programmer    F       411.166667  32.166667
              M       437.966667  33.216667
retired       F       860.000000  70.000000
              M       489.230769  62.538462
salesman      F       637.666667  27.000000
              M       447.333333  38.555556
scientist     F       611.666667  28.333333
              M       449.428571  36.321429
student       F       497.533333  20.750000
              M       479.404412  22.669118
technician    F       938.000000  38.000000
              M       480.692308  32.961538
writer        F       536.052632  37.631579
              M       466.230769  35.346154

### Step 8.  For each occupation present the percentage of women and men

In [152]:
users.groupby(['occupation','gender']).size()

occupation     gender
administrator  F          36
               M          43
artist         F          13
               M          15
doctor         M           7
educator       F          26
               M          69
engineer       F           2
               M          65
entertainment  F           2
               M          16
executive      F           3
               M          29
healthcare     F          11
               M           5
homemaker      F           6
               M           1
lawyer         F           2
               M          10
librarian      F          29
               M          22
marketing      F          10
               M          16
none           F           4
               M           5
other          F          36
               M          69
programmer     F           6
               M          60
retired        F           1
               M          13
salesman       F           3
               M           9
scientist      F           3
               M          28
student        F          60
               M         136
technician     F           1
               M          26
writer         F          19
               M          26
dtype: int64